# DuplicateNamesChanged Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WorksharingFailures..::..DuplicateNamesChanged Property
BuiltInFailures..::..WorksharingFailures Class See Also
---
These elements' names were automatically changed to eliminate duplicates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateNamesChanged { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateNamesChanged As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateNamesChanged {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WorksharingFailures Class
Autodesk.Revit.DB Namespace